app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY id ASC LIMIT 20
---
  def index
    # productsテーブルから最新順に作品を２０件取得する
    @products = Product.order('id ASC').limit(20)